#### Terraform Format and Style 🖌` success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`

<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m

Terraform will perform the following actions:

[1m  # digitalocean_kubernetes_cluster.kubernetes_cluster[0m will be created
[0m  [32m+[0m[0m resource "digitalocean_kubernetes_cluster" "kubernetes_cluster" {
      [32m+[0m[0m cluster_subnet                   = (known after apply)
      [32m+[0m[0m created_at                       = (known after apply)
      [32m+[0m[0m destroy_all_associated_resources = false
      [32m+[0m[0m endpoint                         = (known after apply)
      [32m+[0m[0m ha                               = false
      [32m+[0m[0m id                               = (known after apply)
      [32m+[0m[0m ipv4_address                     = (known after apply)
      [32m+[0m[0m kube_config                      = (sensitive value)
      [32m+[0m[0m name                             = "starry-crawl"
      [32m+[0m[0m region                           = "sfo2"
      [32m+[0m[0m registry_integration             = false
      [32m+[0m[0m service_subnet                   = (known after apply)
      [32m+[0m[0m status                           = (known after apply)
      [32m+[0m[0m surge_upgrade                    = true
      [32m+[0m[0m tags                             = [
          [32m+[0m[0m "k8s",
          [32m+[0m[0m "lab",
        ]
      [32m+[0m[0m updated_at                       = (known after apply)
      [32m+[0m[0m urn                              = (known after apply)
      [32m+[0m[0m version                          = "1.19.3-do.3"
      [32m+[0m[0m vpc_uuid                         = (known after apply)

      [32m+[0m[0m node_pool {
          [32m+[0m[0m actual_node_count = (known after apply)
          [32m+[0m[0m auto_scale        = false
          [32m+[0m[0m id                = (known after apply)
          [32m+[0m[0m name              = "worker-pool"
          [32m+[0m[0m node_count        = 3
          [32m+[0m[0m nodes             = (known after apply)
          [32m+[0m[0m size              = "s-1vcpu-512mb-10gb"
          [32m+[0m[0m tags              = [
              [32m+[0m[0m "k8s",
              [32m+[0m[0m "lab",
            ]
        }
    }

[1mPlan:[0m 1 to add, 0 to change, 0 to destroy.
[0m
Changes to Outputs:
  [32m+[0m[0m cluster-id = (known after apply)
[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @kicka5h, Action: `pull_request`, Working Directory: , Workflow: `PR Lab TF Validate`*